---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.BuildingTypeId
source: html/5ffc9723-8d17-e6b5-68fc-a10a96b02c55.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.BuildingTypeId Property

The building type element.

## Syntax (C#)
```csharp
public ElementId BuildingTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null